{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 50, 10], "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "go_backwards": false, "return_sequences": true, "recurrent_dropout": 0.0, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "units": 15, "stateful": false, "return_state": false, "dtype": "float32", "implementation": 0, "trainable": true, "name": "lstm_1", "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "go_backwards": false, "return_sequences": false, "recurrent_dropout": 0.0, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "units": 15, "stateful": false, "return_state": false, "implementation": 0, "trainable": true, "name": "lstm_2", "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 10}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 10}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "linear"}}], "keras_version": "2.0.5"}