{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 1, 10], "recurrent_activation": "hard_sigmoid", "return_sequences": true, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "dtype": "float32", "recurrent_constraint": null, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "units": 15, "go_backwards": false, "name": "lstm_1", "recurrent_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "return_sequences": false, "bias_constraint": null, "activation": "tanh", "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "implementation": 0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "recurrent_constraint": null, "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "units": 15, "go_backwards": false, "name": "lstm_2", "recurrent_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_1", "bias_regularizer": null, "units": 10, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_2", "bias_regularizer": null, "units": 10, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "sigmoid", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_3", "bias_regularizer": null, "units": 1, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "linear", "trainable": true}}], "keras_version": "2.0.1", "backend": "tensorflow"}