{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "units": 15, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "batch_input_shape": [null, 1, 10], "trainable": true, "return_sequences": true, "activation": "tanh", "stateful": false, "kernel_constraint": null, "unroll": false, "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "bias_regularizer": null, "name": "lstm_15", "dtype": "float32", "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_15"}}, {"class_name": "LSTM", "config": {"go_backwards": false, "units": 15, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "return_sequences": false, "unit_forget_bias": true, "stateful": false, "kernel_constraint": null, "unroll": false, "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "bias_regularizer": null, "name": "lstm_16", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_16"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "name": "dense_9"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_9"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "name": "dense_10"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_10"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "name": "dense_11"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_11"}}], "keras_version": "2.0.1", "backend": "tensorflow"}