{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"return_sequences": true, "trainable": true, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, 100, 10], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "unroll": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "use_bias": true, "dtype": "float32", "name": "lstm_7", "implementation": 0, "bias_constraint": null, "return_state": false, "unit_forget_bias": true, "activation": "tanh", "recurrent_constraint": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "rate": 0.2}}, {"class_name": "LSTM", "config": {"return_sequences": false, "trainable": true, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "use_bias": true, "name": "lstm_8", "implementation": 0, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activation": "tanh", "unroll": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "linear"}}], "keras_version": "2.0.6"}