{"backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 1024, "kernel_constraint": null, "name": "dense_19", "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "batch_input_shape": [null, 9], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32"}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 512, "kernel_constraint": null, "name": "dense_20", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.0010000000474974513}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 256, "kernel_constraint": null, "name": "dense_21", "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 128, "kernel_constraint": null, "name": "dense_22", "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 64, "kernel_constraint": null, "name": "dense_23", "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 32, "kernel_constraint": null, "name": "dense_24", "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 16, "kernel_constraint": null, "name": "dense_25", "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 1, "kernel_constraint": null, "name": "dense_26", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}