{"class_name": "Model", "keras_version": "2.0.6", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["concatenate_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 100, 9], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"trainable": true, "output_shape_type": "lambda", "arguments": {"part": 0, "n_gpus": 4}, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S)\u0001N\u00a9\u0000)\u0001\u00da\u0005shaper\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000|\u0003\u0000d\u0001\u0000\u0019|\u0001\u0000\u001a}\u0004\u0000|\u0002\u0000|\u0001\u0000d\u0002\u0000\u0018k\u0002\u0000r?\u0000|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014d\u0000\u0000\u0085\u0002\u0000\u0019S|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014|\u0002\u0000d\u0002\u0000\u0017|\u0004\u0000\u0014\u0085\u0002\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0005shape)\u0005\u00da\u0001x\u00da\u0006n_gpus\u00da\u0004part\u00da\u0002sh\u00da\u0001L\u00a9\u0000r\n\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\u000bslice_batch\r\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000e\u0001\u0010\u0001\u0012\u0001", null, null], "function_type": "lambda", "name": "lambda_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"trainable": true, "output_shape_type": "lambda", "arguments": {"part": 1, "n_gpus": 4}, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S)\u0001N\u00a9\u0000)\u0001\u00da\u0005shaper\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000|\u0003\u0000d\u0001\u0000\u0019|\u0001\u0000\u001a}\u0004\u0000|\u0002\u0000|\u0001\u0000d\u0002\u0000\u0018k\u0002\u0000r?\u0000|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014d\u0000\u0000\u0085\u0002\u0000\u0019S|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014|\u0002\u0000d\u0002\u0000\u0017|\u0004\u0000\u0014\u0085\u0002\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0005shape)\u0005\u00da\u0001x\u00da\u0006n_gpus\u00da\u0004part\u00da\u0002sh\u00da\u0001L\u00a9\u0000r\n\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\u000bslice_batch\r\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000e\u0001\u0010\u0001\u0012\u0001", null, null], "function_type": "lambda", "name": "lambda_2"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_2", "class_name": "Lambda"}, {"config": {"trainable": true, "output_shape_type": "lambda", "arguments": {"part": 2, "n_gpus": 4}, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S)\u0001N\u00a9\u0000)\u0001\u00da\u0005shaper\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000|\u0003\u0000d\u0001\u0000\u0019|\u0001\u0000\u001a}\u0004\u0000|\u0002\u0000|\u0001\u0000d\u0002\u0000\u0018k\u0002\u0000r?\u0000|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014d\u0000\u0000\u0085\u0002\u0000\u0019S|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014|\u0002\u0000d\u0002\u0000\u0017|\u0004\u0000\u0014\u0085\u0002\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0005shape)\u0005\u00da\u0001x\u00da\u0006n_gpus\u00da\u0004part\u00da\u0002sh\u00da\u0001L\u00a9\u0000r\n\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\u000bslice_batch\r\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000e\u0001\u0010\u0001\u0012\u0001", null, null], "function_type": "lambda", "name": "lambda_3"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_3", "class_name": "Lambda"}, {"config": {"trainable": true, "output_shape_type": "lambda", "arguments": {"part": 3, "n_gpus": 4}, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S)\u0001N\u00a9\u0000)\u0001\u00da\u0005shaper\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000|\u0003\u0000d\u0001\u0000\u0019|\u0001\u0000\u001a}\u0004\u0000|\u0002\u0000|\u0001\u0000d\u0002\u0000\u0018k\u0002\u0000r?\u0000|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014d\u0000\u0000\u0085\u0002\u0000\u0019S|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014|\u0002\u0000d\u0002\u0000\u0017|\u0004\u0000\u0014\u0085\u0002\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0005shape)\u0005\u00da\u0001x\u00da\u0006n_gpus\u00da\u0004part\u00da\u0002sh\u00da\u0001L\u00a9\u0000r\n\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\u000bslice_batch\r\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000e\u0001\u0010\u0001\u0012\u0001", null, null], "function_type": "lambda", "name": "lambda_4"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_4", "class_name": "Lambda"}, {"config": [{"class_name": "LSTM", "config": {"implementation": 0, "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "use_bias": true, "activity_regularizer": null, "unroll": false, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "dtype": "float32", "recurrent_dropout": 0.0, "kernel_constraint": null, "name": "lstm_1", "batch_input_shape": [null, 100, 9], "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "stateful": false, "units": 512, "dropout": 0.0, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"implementation": 0, "bias_regularizer": null, "activation": "tanh", "return_sequences": true, "use_bias": true, "activity_regularizer": null, "unroll": false, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "kernel_constraint": null, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "stateful": false, "units": 512, "recurrent_dropout": 0.0, "bias_constraint": null, "go_backwards": false}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "LSTM", "config": {"implementation": 0, "bias_regularizer": null, "activation": "tanh", "return_sequences": false, "use_bias": true, "activity_regularizer": null, "unroll": false, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "kernel_constraint": null, "name": "lstm_3", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "stateful": false, "units": 512, "recurrent_dropout": 0.0, "bias_constraint": null, "go_backwards": false}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "dense_2", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "dense_3", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_3"}}], "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda_4", 0, 0, {}]]], "name": "sequential_1", "class_name": "Sequential"}, {"config": {"trainable": true, "name": "concatenate_1", "axis": 0}, "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}], ["sequential_1", 3, 0, {}], ["sequential_1", 4, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate"}]}}