{"config": {"output_layers": [["concatenate_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 100, 9], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"arguments": {"n_gpus": 4, "part": 0}, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S)\u0001N\u00a9\u0000)\u0001\u00da\u0005shaper\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "lambda", "trainable": true, "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000|\u0003\u0000d\u0001\u0000\u0019|\u0001\u0000\u001a}\u0004\u0000|\u0002\u0000|\u0001\u0000d\u0002\u0000\u0018k\u0002\u0000r?\u0000|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014d\u0000\u0000\u0085\u0002\u0000\u0019S|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014|\u0002\u0000d\u0002\u0000\u0017|\u0004\u0000\u0014\u0085\u0002\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0005shape)\u0005\u00da\u0001x\u00da\u0006n_gpus\u00da\u0004part\u00da\u0002sh\u00da\u0001L\u00a9\u0000r\n\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\u000bslice_batch\r\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000e\u0001\u0010\u0001\u0012\u0001", null, null], "name": "lambda_1", "function_type": "lambda"}, "name": "lambda_1", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"arguments": {"n_gpus": 4, "part": 1}, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S)\u0001N\u00a9\u0000)\u0001\u00da\u0005shaper\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "lambda", "trainable": true, "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000|\u0003\u0000d\u0001\u0000\u0019|\u0001\u0000\u001a}\u0004\u0000|\u0002\u0000|\u0001\u0000d\u0002\u0000\u0018k\u0002\u0000r?\u0000|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014d\u0000\u0000\u0085\u0002\u0000\u0019S|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014|\u0002\u0000d\u0002\u0000\u0017|\u0004\u0000\u0014\u0085\u0002\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0005shape)\u0005\u00da\u0001x\u00da\u0006n_gpus\u00da\u0004part\u00da\u0002sh\u00da\u0001L\u00a9\u0000r\n\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\u000bslice_batch\r\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000e\u0001\u0010\u0001\u0012\u0001", null, null], "name": "lambda_2", "function_type": "lambda"}, "name": "lambda_2", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"arguments": {"n_gpus": 4, "part": 2}, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S)\u0001N\u00a9\u0000)\u0001\u00da\u0005shaper\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "lambda", "trainable": true, "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000|\u0003\u0000d\u0001\u0000\u0019|\u0001\u0000\u001a}\u0004\u0000|\u0002\u0000|\u0001\u0000d\u0002\u0000\u0018k\u0002\u0000r?\u0000|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014d\u0000\u0000\u0085\u0002\u0000\u0019S|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014|\u0002\u0000d\u0002\u0000\u0017|\u0004\u0000\u0014\u0085\u0002\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0005shape)\u0005\u00da\u0001x\u00da\u0006n_gpus\u00da\u0004part\u00da\u0002sh\u00da\u0001L\u00a9\u0000r\n\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\u000bslice_batch\r\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000e\u0001\u0010\u0001\u0012\u0001", null, null], "name": "lambda_3", "function_type": "lambda"}, "name": "lambda_3", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"arguments": {"n_gpus": 4, "part": 3}, "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S)\u0001N\u00a9\u0000)\u0001\u00da\u0005shaper\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "lambda", "trainable": true, "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sY\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0003\u0000|\u0003\u0000d\u0001\u0000\u0019|\u0001\u0000\u001a}\u0004\u0000|\u0002\u0000|\u0001\u0000d\u0002\u0000\u0018k\u0002\u0000r?\u0000|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014d\u0000\u0000\u0085\u0002\u0000\u0019S|\u0000\u0000|\u0002\u0000|\u0004\u0000\u0014|\u0002\u0000d\u0002\u0000\u0017|\u0004\u0000\u0014\u0085\u0002\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0005shape)\u0005\u00da\u0001x\u00da\u0006n_gpus\u00da\u0004part\u00da\u0002sh\u00da\u0001L\u00a9\u0000r\n\u0000\u0000\u0000\u00fa$/home/carnd/DeepAnomaly/multi_gpu.py\u00da\u000bslice_batch\r\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000e\u0001\u0010\u0001\u0012\u0001", null, null], "name": "lambda_4", "function_type": "lambda"}, "name": "lambda_4", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": [{"config": {"bias_constraint": null, "implementation": 0, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "kernel_regularizer": null, "units": 512, "kernel_constraint": null, "return_sequences": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "recurrent_constraint": null, "go_backwards": false, "unroll": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "use_bias": true, "name": "lstm_1", "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 100, 9], "trainable": true, "stateful": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "kernel_regularizer": null, "units": 512, "implementation": 0, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "unroll": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "use_bias": true, "name": "lstm_2", "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "stateful": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "kernel_regularizer": null, "units": 512, "implementation": 0, "return_sequences": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "unroll": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "use_bias": true, "name": "lstm_3", "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "stateful": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 512, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "name": "sequential_1", "class_name": "Sequential", "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda_4", 0, 0, {}]]]}, {"config": {"name": "concatenate_1", "axis": 0, "trainable": true}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}], ["sequential_1", 3, 0, {}], ["sequential_1", 4, 0, {}]]]}]}, "keras_version": "2.0.6", "class_name": "Model", "backend": "tensorflow"}