{"keras_version": "2.0.6", "backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "use_bias": true, "units": 512, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "batch_input_shape": [null, 100, 9], "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "dtype": "float32", "return_sequences": true, "recurrent_regularizer": null, "stateful": false, "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "return_sequences": true, "use_bias": true, "units": 512, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_2", "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "return_sequences": false, "use_bias": true, "units": 512, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "activation": "tanh", "kernel_regularizer": null, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_3", "implementation": 0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "units": 512, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "units": 128, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "name": "dense_3", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}