{"backend": "tensorflow", "keras_version": "2.0.6", "config": [{"config": {"units": 512, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 100, 9], "recurrent_constraint": null, "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "implementation": 0, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "unroll": false, "stateful": false, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_1", "go_backwards": false, "dtype": "float32", "recurrent_dropout": 0.0, "bias_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 512, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "implementation": 0, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "unroll": false, "stateful": false, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "recurrent_dropout": 0.0, "name": "lstm_2", "unit_forget_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 512, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": false, "kernel_constraint": null, "dropout": 0.0, "implementation": 0, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "unroll": false, "stateful": false, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "recurrent_dropout": 0.0, "name": "lstm_3", "unit_forget_bias": true, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 512, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 128, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 1, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_3", "bias_constraint": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_3", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}