{"keras_version": "2.0.5", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "go_backwards": false, "name": "lstm_1", "activity_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "implementation": 0, "use_bias": true, "dtype": "float32", "activation": "tanh", "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_constraint": null, "dropout": 0.0, "units": 15, "trainable": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "batch_input_shape": [null, 50, 10], "return_state": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "go_backwards": false, "name": "lstm_2", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "implementation": 0, "use_bias": true, "activation": "tanh", "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "return_sequences": false, "dropout": 0.0, "units": 15, "trainable": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "return_state": false}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "dense_3", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "linear"}}], "backend": "tensorflow"}