{"config": [{"config": {"use_bias": true, "dtype": "float32", "batch_input_shape": [null, 30, 10], "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "dropout": 0.0, "unroll": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": false, "name": "lstm_4", "bias_regularizer": null, "recurrent_constraint": null, "implementation": 0, "return_sequences": true, "units": 512, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"recurrent_dropout": 0.0, "implementation": 0, "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "go_backwards": false, "use_bias": true, "dropout": 0.0, "unroll": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "return_state": false, "name": "lstm_5", "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": true, "units": 512, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"recurrent_dropout": 0.0, "implementation": 0, "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "go_backwards": false, "use_bias": true, "dropout": 0.0, "unroll": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "return_state": false, "name": "lstm_6", "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": false, "units": 512, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_6", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_4", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 512, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_5", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 128, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_6", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Sequential"}